var mongoose = require('mongoose');
const Schema = mongoose.Schema;
var Author = require('../models/author');

const Joi = require('joi');
const ColName = 'Weblog'
const perPage = 10

var WeblogSchema = mongoose.Schema({
    Title: {
        type: String,
        required: true,
        trim: true,
        unique: true,
        minlength: 5,
        maxlength: 255
    },
    HTML: {
        type: String,
        required: false,
        minlength: 20,
    },
    ImagePath: {
        type: String,
        required: true,
        minlength: 5,
        maxlength: 1024
    },
    SidebarImagePath:{
        type: String,
        default: "/images/imageadmin.jpg",
        minlength: 5,
        maxlength: 1024
    },
    CreatedAt: {
        type: Date,
        required: false,
        default: Date.now,
    },
    Comments: [{
        username: {
            type: String,
            required: true,
            maxlength: 60,
        },
        email: {
            type: String,
            required: true,
            maxlength: 60
        },
        content: {
            type: String,
            required: true,
            minlength: 5,
            maxlength: 200
        },
        ImagePath: {
            type: String,
            default: "/images/imageadmin.jpg",
            minlength: 5,
            maxlength: 1024
        },

        CreatedAt: {
            type: Date,
            required: false,
            default: Date.now,
        },

    }]
});


var Weblog = module.exports = mongoose.model(ColName, WeblogSchema);

module.exports.perPage = perPage
module.exports.getWeblogById = function (id, callback) {
    Weblog.findById(id, callback);
}

module.exports.getWeblogByWeblogname = function (Weblogname, callback) {
    var query = { Name: Weblogname };
    Weblog.findOne(query, callback);
}

module.exports.getWeblogByPage = async function (page) {
    page = page && page > 0 ? page - 1 : 0;
    return await Weblog.find({}, null, {
        skip: page * perPage,
        limit: perPage
    }).sort([['CreatedAt', 'descending']]);
}

module.exports.validateWeblog = function (Weblog) {
    const JoiSchema = Joi.object({
        Name: Joi.string().min(5).max(255).required(),
        Category: Joi.string().min(5).max(255).required(),
        Author: Joi.string().min(5).max(255).required()

    });

    return JoiSchema.validate(Weblog, { abortEarly: false });
}
mongoose.connection.on('connected', function () {
    Weblog.count(async function (err, count) {
        if (count == 0 && !err) {
            seedWeblogs = []
            seedWeblogs.push(
                new Weblog({//#FillUP
                    Title: "10 حقیقت جالب در مورد چارلز دیکنز در سالروز درگذشت او که تا به حال نشنیده‌اید",
                    HTML: `
                    <p>چارلز دیکنز با نام کامل «چارلز جان هوفام دیکنز»، نویسنده مشهور انگلیسی و به عبارتی مشهورترین نویسنده عصر ویکتوریاست. او خالق برخی از مشهورترین کتاب‌های داستان و رمان در تاریخ ادبیات دنیاست. آثاری چون داستان دو شهر، الیور تویست، خانه متروکه یا خانه اشباح، آرزوهای بزرگ، دیوید کاپرفیلد و … بود که در تاریخ ۹ ژوئن سال ۱۸۷۰ میلادی درگذشت. به همین مناسب بد نیست ۱۸ حقیقت جالب در مورد این نویسنده مشهور دنیای ادبیات داستانی را از سایت Mental Floss در مجله کوروش بخوانید.</p>
                    <h4>۱-چارلز از دوران کودکی مجبور بود کار کند</h4>
                    <p>فرزند ارشد الیزابت و جان دیکنز در فوریه ۱۸۱۲ در جزیره پورتس در شهر پورتسموث بریتانیا متولد شد و در سال‌های جوانی با خانواده اش به یورکشایر و سپس لندن رفت. در آن زمان چارلز یک پسر بچه کوچک بود.
                    
                        هنگامی که پدرش دوباره به لندن فراخوانده شد تا در منشی نیروی دریایی کارمند شود، آنقدر بدهی بالا آورده بود که کل خانواده – به جز چارلز و خواهر بزرگترش فانی – به زندان بدهکاران مارشال فرستاده شدند.</p>
                    <h4>۲-شغلی که زندگی دیکنز جوان را متحول کرد</h4>
                    <p>در سال‌های ۱۸۲۷ و ۱۸۲۸، دیکنز ۱۵ ساله کارش به عنوان منشی در دفتر وکالت الیس و بلک مور را آغاز کرد اما به جای اینکه دل به کارهای حقوقی بدهد و به عرصه وکالت وارد شود تمام هم و غمش را روی نوشتن گذاشت. او برای نوشتن از متد «توماس گورنی» که مهارت تندنویسی بود الگوبرداری می‌کرد. آموختن این مهارت به او کمک کرد تا در دهه ۱۸۳۰ کارش را در کسوت خبرنگار در پارلمان بریتانیا شروع کند. چارلز جوان ابتدا منشی و تندنویس یکی از نمایندگان مجلس عوام و پس از آن خبرنگار روزنامه «مورنینگ کرونیکل» در پارلمان شد.</p>
                    <h4>۳-چارلز دیکنز تا سال‌ها آثارش را با اسم مستعار می‌نوشت</h4>
                    <p>
                        اولین آثار چارلز دیکنز در سال‌های ۱۸۳۳ و ۱۸۳۴ بدون اسم نویسنده منتشر شده. در آگوست سال ۱۸۳۴، داستان کوتاه او «خانه شبانه روزی»، با نام مستعار انتخابی چارلز دیکنز یعنی «بوز» در یک ماهنامه چاپ شد.
                        
                        این اسم تک هجایی از اثر کودکی شخصیت موسی در رمان نویسنده ایرلندی الیور گلدسمیت، ویکفار ویکفیلد، که بعداً در کتاب داستانهای دو شهر دیکنز هم از آن اسم برده شد، آمده است. این نام مستعار بعدها به حدی محبوب شد که او تلفیقی از مقاله‌ها و داستان‌های کوتاه خود را با نام Sketches by Boz در سال ۱۸۳۹ منتشر کرد.</p>
                    <h4>۴-چارلز دیکنز احتمالا مبتلا به بیماری صرع بوده است</h4>
                    <p>
                        اگرچه هرگونه نشانه ای از احتمال ابتلا به صرع چارلز دیکنز با بررسی پرونده پزشکی او تایید نشده است، اما او آنقدر در مورد شخصیت‌های خود در مورد این بیماری صحبت کرده است که برخی حدس می‌زنند که احتمال او مبتلا به صرع بوده است. شخصیت‌هایی مانند Guster در کتاب خانه متروکه، شخصیت مانکس (برادر الیور) در کتاب Oliver Twist و Bradley Headstone در اثر Friend Mutual Friend، همه از بیماری صرع رنج می‌برند.</p>
                    <h4>۵-چارلز دیکنز از آمریکایی‌ها خوشش نمی‌آمد</h4>
                    <p>
                        در سال ۱۹۸۲ نیویورک یک مهمانی باشکوه به افتخار چارلز دیکنز در پارک تئاتر، یکی از باشکوه‌ترین مکان‌های شهر با سه هزار مهمان و طراحی مجسمه نیم تنه دیکنز برگزار کرد. در آن زمان دیکنز جوان آثار مشهوری چون الیور تویست و آقای پیکویک را منتشر کرده بود و یکی از مشهورترین نویسندگان دنیا بود. با اینکه در این سفر چارلز دیکنز شیفته آمریکا و به خصوص شهر بوستون شده بود اما از جنجال و شور و اشتیاق هواداران آمریکایی‌اش خیلی زود دلزده شد.دیکنز احساس می‌کرد میزبانان آمریکایی‌اش سعی دارند از او سوءاستفاده کنند.
                        
                        </p>
                    <h4>۶-چارلز دیکنز به همسر سر جان فرانکلین برای پیدا شدن او کمک کرد</h4>
                    <p>
                        کاپیتان سرجان فرانکلین و یارانش زمانی که برای یافتن گذرگاه شمال غربی کانادا به این منطقه رفته بودندمفقود شدند و ازهمان هنگام عملیات گسترده ای برای یافتن آنان شروع شد که تاکنون هم این تلاش‌ها نافرجام بوده است. مرگ اسرار آمیز این اکتشافگران در میان یخ‌های قطبی که یکی از بزرگ‌ترین فاجعه‌های اکتشافی در تاریخ انگلیس محسوب می‌شود، در طول سالیان طولانی سوژه‌ای ناب و دستمایه‌ای برای نویسندگان، مورخان و حتی ترانه‌سراها بوده است. در این میان چارلز دیکنز در آن زمان به همسر سر جان فرانکین کمک‌های زیادی کرد تا او پیدا شود از سخنرانی در سرتاسر انگلیس به امید جمع‌آوری پول برای نجات دادن آن‌ها تا یک تحلیل دو قسمتی به نام «سفرهای گمشده قطب شمال» برای تشویق به پیدا کردن سر جان فرانکلین و یاران گم شده‌اش.
                        
                        </p>
                    <h4>
                        ۷-چارلز دیکنز برای تحریک اشتیاق خوانندگان پایان هر اپیزود را معلق می‌گذاشت
                        </h4>
                    <p>
                        بیشتر رمان‌های دیکنز از جمله کلاسیک‌هایی مانند دیوید کوپرفیلد و الیور تویست در ابتدا به صورت ماهیانه ، هفتگی و یا موارد نادر به صورت اشتراکی یا در پاورقی مجلات نوشته می‌شدند و فقط بعداً به صورت کامل کتاب منتشر می شدند. در نوشتن هر اپیزود از داستان چارلز دیکنز عادت داشت که پایان هر قسمت را باز و معلق بگذارد تا اشتیاق مخاطبانش را برای خواندن ادامه داستان بیش از پیش تحریک کند.</p>
                    <h4>۸-پرنده خانگی دیکنز یک کلاغ بود</h4>
                    <p>
                        دیکنز عاشق کلاغی بود که به عنوان حیوان خانگی از آن نگهداری می‌کرد و نامش را «گریپ» گذاشته بود. وقتی که این پرنده به خاطر خوردن تراشه‌های آلوده به سرب جانش را از دست داد دیکنز آن را تاکسیدرمی کرد و در اتاق مطالعه‌اش گذاشت. گریپ حتی در رمانش «بارنابی رودگ» نیز به عنوان یک شخصیت ظاهر می‌شود. بعد از مرگ گریپ اول، دیکنز دوباره یک کلاغ را به عنوان پرنده خانگی به سرپرستی گرفت و نامش را گریپ دوم گذاشت. گفته می‌شود که گریپ دوم الهام‌بخش شعر «گاوزبان» ادگار آلن پو بوده است. بعد از مرگ گریپ دوم، دیکنز دوباره او را تاکسیدرمی کرد و در یک باکس چوبی و شیشه‌ای قرار داد. هم اکنون در مجموعه کتابخانه فلادلفیا نگهداری می‌شود.</p>
                    <h4>
                        ۹-به نظر می‌رسد چارلز دیکنز بیش‌فعال بوده است</h4>
                    <p>
                        دیکنز فردی بسیار پرانرژی بود به گونه‌ای که او که اغلب نمی‌توانست بخوابد، پیاده‌روی‌های شبانۀ طولانی‌ در خیابان‌های لندن تقریبا کار هر شب او بود. همراه او در بیشتر این پیاده‌روی‌ها، ویلکی کالینز، نویسندۀ کتاب «سنگ ماه» بود.</p>
                    <h4>
                        ۱۰-چارلز دیکنز یک گربه خانگی هم داشت</h4>
                    <p>دیکنز یک جمله معروف داشت: «چه هدیه‌ای بالاتر از عشق به یک گربه وجود دارد؟» علاوه بر کلاغ، چارلز دیکنز همیشه یک گربه داشت که دور و بر او می‌پلکید. باب، گربه مشهور چارلز دیکنز در سال ۱۸۶۲ جانش را از دست داد و چارلز پنجه این گربه را پر کرد و روی یک نامه بازکن از جنس عاج سوار کرد. این نامه بازکن هم اکنون در مجموعه ادبیات انگلیسی در کتابخانه عمومی نیویورک نگهداری می‌شود.</p>
                    `,
                    ImagePath: "/images/image15.jpg",
                    SidebarImagePath:"/images/image18.jpg",
                    Comments: [
                        {
                            username: "میلاد ",
                            email: "aaa@a.a",
                            content: "جالب بود ! سپاس از اطلاعات تان !                            ",
                            ImagePath: "/images/imagemili.PNG",
                        }, {
                            username: "ستاره ",
                            email: "aaa@a.a",
                            content: "جالب بود ! سپاس از اطلاعات تان !                            ",
                            ImagePath: "/images/imagesetare.jpg",
                        },
                    ]
                }),
                new Weblog({//#FillUP
                    Title: "در قرنطینه چه کتاب‌هایی بخوانیم؛ معرفی ۱۲ کتاب از بهترین و پرفروش‌ترین رمان‌های دنیا",
                    HTML: `
                    <p>کتاب خوب، صادق‌ترین و بی‌ریاترین دوست انسان است. این روزها که به خاطر شیوع ویروس کرونا کووید ۱۹ و پیشگیری از ابتلا به بیماری کرونا در خانه مانده‌ایم و خودمان را قرنطینه کرده‌ایم یکی از بهترین سرگرمی‌ها خواندن کتاب است. در میان میلیون‌ها کتابی که در سرتاسر دنیا وجود دارد برخی شاهکارهای ادبیات برای عاشقان کتابخوانی در همه کشورهای دنیا محبوب و پرفروشند.

	اگر شما هم مثل ما اعتقاد دارید که باید کتاب‌های خوب و مفید را برای مطالعه به همدیگر معرفی کنیم پس یک لیست معرفی کتاب ۱۲ تایی از شاهکارها و بهترین و پرفروش‌ترین کتاب‌های رمان دنیا که به دلایل مختلف شایسته این لقب تشخیص داده شده‌اند را به انتخاب منتقدان سایت ادبی معتبر Britannica با ما مرور کنید.</p>
	<h4>۱- آنا کارنینا؛ سرگشتی‌های بانو آنا</h4>
	<p>هر ویژگی که یک عاشق و خوره کتاب از یک شاهکار ادبی و رمان هیجان‌انگیز انتظار دارد همگی با آب و تاب در کتاب جذاب و پرکشش «آنا کارنینا» اثر لئون تولستوی آورده شده‌اند: بی‌وفایی، شرط‌بندی، دسیسه و توطئه و البته فئودالیسم روسی در قالب نثری فخیم و غیر مبتذل. این کتاب که از زمان نخستین چاپش در سال ۱۸۷۸ تاکنون همواره در لیست بهترین رمان‌های ادبی جهان مجله ادبی معتبر «Time Magazine» قرار داشته است، روایت روابط خانواده‌های اشرافی روسیه در قرن ۱۹ میلادی است و شخصیت اصلی آن زنی به نام آنا کارنینا است.</p>
	<h4>۲- کشتن مرغ مقلد؛ معصومیت از دست رفته</h4>
	<p>هارپر لی، نویسنده کتاب «مرغ مقلد» که در تمام عمر فقط همین یک کتاب را نوشت به عقیده منتقدان حتی با همین یک کتاب به عنوان یکی از بهترین و پرفروش‌ترین کتاب‌های رمان دنیا ، یکی از تاثیرگذارترین نویسنده‌های تاریخ ادبیات دنیاست. نخستین نسخه کتاب «مرغ مقلد» در سال ۱۹۶۰ به چاپ رسید و تبدیل به یکی از شاهکارهای ادبیات کلاسیک شد. هارپر به خاطر این کتاب برنده یکی از معتبرترین جوایز ادبی یعنی «پولیتزر» شد. داستانِ کتاب از زبانِ دخترِ نوجوانی به نام «اسکات فینچ» روایت می‌شود که در شهر کوچکی در ایالت آلاباما آمریکا زندگی می‌کند. پدر اسکات وکیل است و در زمان وقوع داستان پرونده‌ مرد سیاه‌پوستی را پذیرفته که متهم است به دختر سفیدپوستی تجاوز کرده است و… مرغ مقلد یا همان مرغ مینا در این کتاب نمادی از معصومیت است. از روی این کتاب یک فیلم سینمایی مشهور به همین نام ساخته شده که یکی از محبوب‌ترین فیلم‌های تاریخ سینما تاکنون است.</p>
	<h4>۳- گتسبی بزرگ؛ یک کتاب شاهکار، یک فیلم منحصر‌به‌فرد</h4>
	<p>اسکات فیتز جرالد در «گتسبی بزرگ» به عنوان یکی از صد رمان برتر قرن بیستم و یکی از بهترین و پرفروش‌ترین کتاب‌‌های رمان دنیا ، داستان مردی ثروتمند اما مشکوک را از زبان فردی به نام «نیک» روایت می‌کند که همواره در حال خوشگذرانی و مهمانی دادن است و البته هیچ کس نمی‌داند که او این همه ثروت را از کجا آورده است. شایعات زیادی همواره حول و حوش زندگی و روابط «جی گتسبی» بر سر زبان‌هاست، این‌که او فرزند یک خانواده فقیر بوده که عاشق دختری ثروتمند می‌شود و زمانی که عنوان افسر نیروی زمینی به جنگ جهانی اول اعزام می‌شود، دختر مورد علاقه‌اش با فردی ثروتمند ازدواج می‌کند و همین مسئله حوادث بعدی داستان را رقم می‌زند. تاکنون چندین فیلم از روی این رمان ساخته شده است که آخرین آن‌ها با بازی «لئوناردو دی‌کاپریو» در سال ۲۰۱۳ روی پرده سینماهای جهان رفت.</p>
	<h4>۴- صد سال تنهایی</h4>
	<p>امکان ندارد که بخواهیم یک لیست از بهترین کتاب‌ های رمان دنیا صحبت کنیم و «صد سال تنهایی» را نادیده بگیریم. کتابی پر کشش و پر از شخصیت‌های متفاوت نوشته گابریل گارسیا مارکز. کتاب که در سال ۱۹۶۷ نوشته شده داستان زندگی خانواده یک سرهنگ در شرف اعدام به نام «بوئندیا» است که در لحظه مرگ تمام خاطرات زندگی از جلو چشمانش عبور می‌کند. رمان «صد سال تنهایی» در حقیقت داستان زندگی شش نسل یک خانواده از اهالی آمریکای جنوبی است که در دهکده‌ای به نام ماکوندو زندگی می‌کنند.

		کتاب در حقیقت بر پایه سبک رئالیسم جادویی نوشته شده و جایزه نوبل ادبیات را در سال ۱۹۸۲ برای نویسنده‌اش به ارمغان آورد. صد سال تنهایی توسط مترجمان زیادی به فارسی برگردانده شده که یکی از بهترین ترجمه‌های این کتاب اثر مرحوم «بهمن فرزانه» است.
		
		</p>
	<h4>۵- گذری به هند</h4>
	<p>رمانی پرکشش نوشته «مورگان فوستر» که داستان زندگی زن انگلیسی به همراه پسر قاضی و عروسش در هندوستان است. در این گیر و دار زن انگلیسی که خانم «مور» نام دارد با پزشکی هندی به نام دکتر عزیز آشنا می‌شوند. این در حالی است که انگلیسی‌ها که در آن زمان هندوستان را تحت سلطه خود داشتند چندان تمایلی به معاشرت هندی‌ها با انگلیسی‌های ساکن هند ندارند و به شدت با این قضایا برخورد می‌کنند. کتاب «گذری به هند» به عنوان یکی از بهترین و پرفروش‌ترین کتاب‌‌های رمان دنیا هم در حقیقت داستان تنشی آشکار میان جامعه هند و بریتانیای‌هایی است که این کشور را اشغال کرده‌اند.

	</p>
	<h4>۶- مرد نامرئی؛ من را ببین</h4>
	<p>«مرد نامرئی»، نوشته «رالف الیسون» نویسنده ، معلم و منتقد سیاهپوست آمریکایی است. کتاب شرح حال مردی سیاهپوست است که توسط اطرافیان همواره نادیده گرفته می‌شود. شخصیت اصلی کتاب که در واقع همان مرد نامرئی است در طول داستان هیچ نامی ندارد و در حقیقت به خاطر زندگی در یک جامعه آمریکایی پر از خشونت و تعصب علیه جامعه آفریقایی-آمریکایی و در واقع سیاهپوستان ساکن آمریکا هویتش را از دست می‌دهد. 

		رمان با چنین جملاتی آغاز می‌شود: «من مردی نامرئی هستم. نه، من از آن موجودات خیالی ترسناک محبوب ادگار آلن پو نیستم، محصول سینمای هالیوود هم نیستم. من آدمی هستم با پوست و گوشت، خون و بافت… و می‌توانم بگویم عقل هم دارم. من نامرئی هستم چون مردم ترجیح می‌دهند مرا نبینند، می‌فهمید؟»
		
		این کتاب در سال ۱۹۵۳ جایزه بهترین کتاب داستان ملی آمریکا را از آن خود کرد.</p>
	<h4>۷- دون کیشوت؛ توهمات یک ذهن آشفته</h4>
	<p>کتابی که هر کس باید در قفسه کتابخانه منزل یا محل کارش داشته باشد. رمانی مشهور اثر «میگل دی سروانتس» که به احتمال زیاد مشهورترین و محبوب‌ترین کتاب تاریخ ادبیات اسپانیاست که در ایران با ترجمه بی‌نظیر مرحوم «محمد قاضی» بارها تجدید چاپ شده است. «دون کیشوت» برای نخستین بار در سال ۱۶۱۵ منتشر شد و سروانتس بخش نخست آن را زمانی که زندانی بود نوشت. در قسمتی از مقدمه رمان دن کیشوت به قلم مترجم آمده است: شاید تاکنون هیچ کتابی به اندازه دن کیشوت این همه مورد عشق و علاقه ملت‌های گوناگون نبوده است.</p>
	<h4>۸- دلبند؛ مرثیه‌ای برای سیاهپوستان</h4>
	<p>داستانی پرکشش و پر از دست انداز نوشته «تونی موریسون» که روایت زندگی پر از مشقت بردگان سیاهپوست را در قرن ۱۹ میلادی در امریکا است. شخصیت اصلی رمان «دلبند» زنی سیاهپوست به نام «ست» است که به اوهایو فرار می‌کند اما بعد از گذشت سال‌ها هنوز هم احساس اسارت می‌کند. خاطرات مزرعه‌ای که در آن برده بود، احساس گناه مداوم به خاطر نوزادش که مجبور شده به خاطر فرار از مزرعه او را بکشد و همچنان حضور و روحش را در خانه احساس می‌کند. نوزادی که هیچ‌گاه اسمی نداشت و زمانی که می‌خواستند برای نوزاد مرده سنگ قبر بسازند یک کلمه روی آن نوشتند: دلبند. تون موریسون برای این رمان غمگین و تراژیک جایزه ادبی پولیتزر را در سال ۱۹۸۸ از آن خود کرد.</p>
	<h4>۹- خانم دالووی؛ یک روز با خانم دالووی</h4>
	<p>به احتمال زیاد «خانم دالوی» عجیب‌ترین رمان «ویرجینیا ولف» است. رمان خانم دالووی شرح یک روز از زندگی یک زن ثروتمند و اهل معاشرت در جامعه بریتانیا با نام «کلاریسا دالووی» است که از زبان سوم شخص روایت می‌شود. داستان از صبح روزی در ماه ژوئن آغاز می‌شود که خانم دالووی به قصد خریدن گل برای مهمانی باشکوهی که قرار است شب در منزلش برگزار شود و مهمانان مهمی از جمله نخست‌وزیر به این مهمانی دعوت هستند از خانه بیرون می‌رود و… شخصیت‌های فراوان در طول داستان با افکار گذشته، بیماری‌های ذهنی و روحی، استرس‌های ناشی از جنگ جهانی اول، شرایط و فشارهای اجتماعی و … دسته و پنجه نرم می‌کنند و همین مسائل شالوده اصلی داستان را تشکیل می‌دهند.</p>
	<h4>۱۰- چیزهایی که در هم شکسته</h4>
	<p>ادبیات غرب معمولا به کتاب‌هایی که توسط نویسندگان اهل شمال آمریکا، آمریکایی لاتین یا اروپا نوشته می‌شوند روی خوش نشان می‌دهند. اما این بار نویسنده‌ای آفریقایی و اهل نیجریه به نام «چینوا آ چه بی» اثری خلق کرده که سالهاست مورد توجه منتقدان ادبی است. «چیزهایی که در هم شکسته» داستان زندگی مردمان اهل قاره آفریقاست که با ورود مبلغان مسیحی و استعمارگران اروپایی زندگی‌شان دچار بحران می‌شود و گاهی از هم می‌پاشد.</p>
	<h4>۱۱- جین ایر؛ عشق و جنون</h4>
	<p>«شارلوت برونته» نویسنده انگلیسی در قرن نوزدهم میلادی با خلق رمان اجتماعی و ادبی «جین ایر» به عنوان یکی از بهترین کتاب های رمان تاریخ نام خود را بر سر زبان‌ها انداخت. رمان دربارهٔ زندگی دختری به نام جین است که در کودکی مادر و پدر خود را از دست می‌دهد و پس از ناملایماتی که از خاله و پسر خاله‌هایش می‌بیند به پرورشگاه سپرده می‌شود و در محیط خشک و خشن پرورشگاه بزرگ می‌شود.

	</p>
	<h4>۱۲- به رنگ ارغوان</h4>
	<p>اگر بخواهیم د رمورد یکی از بهترین و پرفروش‌ترین کتاب‌های رمان دنیا صحبت کنیم «به رنگ ارغوان» یکی از آن‌هاست. رمانی آمریکایی که نویسنده‌اش «آلیس واکر» به خاطر نوشتن آن برنده جایزه ادبی پولیتزر و جایزه کتاب ملی آمریکا شد. داستان از این قرار است که «سِلی جکسن»، دختر نوجوان سیاه‌پوستی است، که پدرش فرزندان او را به خانواده ثروتمند «ساموئل‌«ها می‌فروشد. خود او را نیز به آلبرت‌ جانسن گلاور، مرد سیاه‌پوست بیوه‌‌ای واگذار می‌کند، که در واقع عاشق خواهر «سلی» یعنی «نتی» (بوسیا) بوده است.

    </p>
     `,
                    ImagePath: "/images/image14.jpg",
                    SidebarImagePath:"/images/image17.jpg",
                    Comments: [
                        {
                            username: "میلاد ",
                            email: "aaa@a.a",
                            content: "جالب بود ! سپاس از اطلاعات تان !                            ",
                            ImagePath: "/images/imagemili.PNG",
                        }, {
                            username: "ستاره ",
                            email: "aaa@a.a",
                            content: "واقعا جای کتابای خوب دیگه ای خالی بود!                            ",
                            ImagePath: "/images/imagesetare.jpg",
                        },
                    ]
                })
                
                )



            Weblog.insertMany(seedWeblogs, (err, docs) => {
                if (!err) {
                    console.log("Weblogs Seeded DB...");
                } else {
                    console.log("[!] Weblog Seed Error : " + err);
                }
            })
        }
    })
});




